org/pomodorocoder.org
#+TITLE: Pomodoro Coder

#+HUGO_BASE_DIR: ./temp/
#+HUGO_SECTION: ./
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

***** Intro to State
:PROPERTIES:
:EXPORT_FILE_NAME: state-intro
:EXPORT_DATE: <2017-11-13 Mon>
:END:
****** Objectives

       - Define State in React
       - Create a component with a constructor and state
       - Describe what happens when setState is called

****** State Definition

       - Stateful Data: Data in our applications that can be changed
       - Unlike ~props~ that cannot be changed

****** State Example

An example:
#+begin_src js
class App extends Component {
    constructor(props) {
        super(props);
        this.state = {favColor: "red"};
    }

    render() {
        return (
            
            <div>
                My favorite color: {this.state.favColor}
            </div>
        )
    }
}
#+end_src
      
****** setState 
       - How to change the state here? The correct way to change state in the app is using setState
       - setState accepts an object with new properties and values for this.state
       - Create a new object and change the state for newly created object
       - Should never never modify state directly in the original object

#+begin_src js
this.setState({});
#+end_src

Example of changing state

#+begin_src js
class App extends Component {
    constructor(props) {
        super(props);
        this.state = {favColor: "red"};
        setTimeout(() => {
            this.setState({favColor: "blue"})
        }, 3000);
    }

    render(){
        return(
          <div>
            The current Color is:
            {this.state.favColor}
          </div>
        );
    }
}
#+end_src

